test-docs/InvalidSOAP-nesting-levels.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.example.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:Level1>
         <web:Level2>
            <web:Level3>
               <web:Level4>
                  <web:Level5>
                     <web:Level6>
                        <web:Level7>
                           <web:Level8>
                              <web:Level9>
                                 <web:Level10>
                                    <web:Level11>
                                       <web:Level12>
                                          <web:Level13>
                                             <web:Level14>
                                                <web:Level15>
                                                   <web:Level16>
                                                      <web:Level17>
                                                         <web:Level18>
                                                            <web:Level19>
                                                               <web:Level20>
                                                                  <web:Level21>
                                                                     <web:Level22>
                                                                        <web:Level23>
                                                                           <web:Level24>
                                                                              <web:Level25>
                                                                                 <web:Level26>
                                                                                    <web:Level27>
                                                                                       <web:Level28>
                                                                                          <web:Level29>
                                                                                             <web:Level30>
                                                                                                <web:Level31>
                                                                                                   <web:Level32>
                                                                                                      <web:Level33>
                                                                                                         This is the deepest level.
                                                                                                      </web:Level33>
                                                                                                   </web:Level32>
                                                                                                </web:Level31>
                                                                                             </web:Level30>
                                                                                          </web:Level29>
                                                                                       </web:Level28>
                                                                                    </web:Level27>
                                                                                 </web:Level26>
                                                                              </web:Level25>
                                                                           </web:Level24>
                                                                        </web:Level23>
                                                                     </web:Level22>
                                                                  </web:Level21>
                                                               </web:Level20>
                                                            </web:Level19>
                                                         </web:Level18>
                                                      </web:Level17>
                                                   </web:Level16>
                                                </web:Level15>
                                             </web:Level14>
                                          </web:Level13>
                                       </web:Level12>
                                    </web:Level11>
                                 </web:Level10>
                              </web:Level9>
                           </web:Level8>
                        </web:Level7>
                     </web:Level6>
                  </web:Level5>
               </web:Level4>
            </web:Level3>
         </web:Level2>
      </web:Level1>
   </soapenv:Body>
</soapenv:Envelope>
